Revit 2027 API
View3D.Unlock Method
 Unlocks the view. Has no effect if the view is already unlocked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Unlock()
Public Sub Unlock
public:
void Unlock()
member Unlock : unit -> unit
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace